title: FortiGate UTM DNS Botnet Domain Blocked
id: b6320cca-4ab8-4e4f-9532-eeb24e5ae00c
status: experimental
description: Detects FortiGate UTM DNS events where a domain or IP address was blocked at the DNS name resolving stage by FortiGuard Services DNS botnet C&C protection.
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/fortios-log-message-reference/54601/54601-log-id-dns-botnet-domain
    - https://docs.fortinet.com/document/fortigate/7.4.1/fortios-log-message-reference/54600/54600-log-id-dns-botnet-ip
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/105208/botnet-c-c-domain-blocking
    - https://community.fortinet.com/t5/FortiGate/Technical-Tip-Botnet-C-C-domain-blocking/ta-p/190258
tags:
    - attack.command_and_control
    - attack.t1071.004
author: '@JayInfoSec'
date: 2023/11/20
logsource:
    category: firewall
    product: fortigate
detection:
    selection:
        type: 'utm'
        subtype: 'dns'
        eventtype: 'dns-response'
        logid|endswith:
            - '54600'   # Domain blocked by DNS botnet C&amp;C (IP)
            - '54601'   # Domain blocked by DNS botnet C&amp;C (Domain)
        severity:
            - 'critical'
            - 'high'
            - 'medium'
        srcip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection
fields:
    - dstip
    - action
    - botnetdomain
    - qname
falsepositives:
    - Unknown
level: medium