title: FortiGate Infected UTM Virus Blocked
id: f6da46c4-e1ec-4d2b-b0c1-da0992492e3e
status: experimental
description: Detects FortiGate NGFW UTM Virus activity where a file was blocked because it contains a file.
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/986892/sample-logs-by-log-type # Sample Logs
tags:
    - attack.execution
author: '@JayInfoSec'
date: 2023/11/20
logsource:
    category: appliance
    product: fortigate
    service: utm
detection:
    selection:
        type: 'utm'
        subtype: 'virus'
        eventtype: 'filename'
        logid|endswith:
            - '8448'   # FortiGate unit blocked a file because it contains a virus
        severity:
            - 'critical'
            - 'high'
            - 'medium'
        srcip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection
fields:
    - user
    - virusid
    - srcip
    - srccountry
    - dstip
falsepositives:
    - Unknown
level: informational