title: FortiGate UTM Virus Signatures From Multiple Private Network Sources
id: 20df04d2-f05a-4d55-98ea-cd91de71ea19
status: experimental
description: Detects a FortiGate NGFW UTM Virus signature on multiple hosts in the private network which may indicate an infection on multiple devices.
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/986892/sample-logs-by-log-type # Sample Logs
tags:
    - attack.execution
    - attack.t1059
author: '@JayInfoSec'
date: 2023/11/20
logsource:
    category: appliance
    product: fortigate
    service: utm
detection:
    selection:
        type: 'utm'
        subtype: 'virus'
        severity:
            - 'critical'
            - 'high'
            - 'medium'
        srcip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection
fields:
    - user
    - attack
    - url
    - srcip
    - srccountry
    - dstip
falsepositives:
    - Unknown
level: critical

---
title: Fortigate Utm Virus Signatures From Multiple Private Sources (Correlation)
id: bfc68535-7643-428c-bc8f-f37cc1316640
correlation:
    type: value_count
    rules:
        - fortigate_virus_signatures_multi_private
    group-by:
        - attack
    timespan: 10m
    condition:
        gt: 5
        field: srcip
