title: Sentinelone Malicious Threat Detection
id: 745239f4-6cfa-459c-a6fc-9bc2cd497354
status: experimental
description: Detect when SentinelOne raises a malicious threat where the Agent AI is very confident that the threat is malicious.
references:
    - https://docs.datadoghq.com/security/default_rules/sentinelone-threats-third-party/
author: '@JayInfosec'
date: 2024-10-23
tags:
    - attack.execution
    - attack.persistence
    - attack.lateral-movement
    - attack.credential-access
    - attack.initial-access
    - attack.discovery
    - attack.collection
    - attack.exfiltration
    - attack.defense-evasion
    - attack.impact
logsource:
    category: edr
    product: sentinelone
    service: malware
detection:
    selection:
        fieldname:
            - 'malicious'
    condition: selection
falsepositives:
    - Unknown
level: critical
