title: Sentinelone Suspicious Threat Detection
id: 90f1adf7-6a5c-416e-aba8-d8ec389807a8
status: experimental
description: Detect when SentinelOne raises a suspicious threat, where the Agent AI found traits that are suspicious, but not enough to mark it as malicious..
references:
    - https://docs.datadoghq.com/security/default_rules/sentinelone-threats-third-party/
author: '@JayInfosec'
date: 2024-10-23
tags:
    - attack.execution
    - attack.persistence
    - attack.lateral-movement
    - attack.credential-access
    - attack.initial-access
    - attack.discovery
    - attack.collection
    - attack.exfiltration
    - attack.defense-evasion
    - attack.impact
logsource:
    category: edr
    product: sentinelone
    service: malware
detection:
    selection:
        fieldname:
            - 'suspicious'
    condition: selection
falsepositives:
    - Unknown
level: high
