title: FortiGate UTM IPS Signature from Private Network
id: f08294bc-5a3a-4f64-8ec7-250398da8e9c
status: experimental
description: Detects FortiGate UTM IPS critical, high or medioum severity attack signatures originating from systems within the private network.
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/986892/sample-logs-by-log-type # Sample Logs
tags:
     - attack.initial_access
     - attack.t1190
author: 'Jay Tymchuk (@JayInfoSec)'
date: 2023/11/20
logsource:
    category: firewall
    product: fortigate
detection:
    selection:
        type: 'utm'
        subtype: 'ips'
        eventtype: 'signature'
        logid|endswith:
            - '16384'   # Attack detected by UDP/TCP signature
            - '16385'   # Attack detected by ICMP signature
            - '16386'   # Attack detected by other signature
        severity:
            - 'critical'
            - 'high'
            - 'medium'
        srcip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection
fields:
    - user
    - attack
    - url
    - srcip
    - srccountry
    - dstip
falsepositives:
    - Unknown
level: high