title: FortiGate UTM IPS Multiple Allowed Signatures from Public Network
id: 4086323b-6662-456d-a2d3-731ceecf1a3e
status: experimental
description: Detects multiple FortiGate NGFW UTM IPS attack signatures originating from a single source from the public network.
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/986892/sample-logs-by-log-type # Sample Logs
tags:
    - attack.execution
    - attack.t1059
author: '@JayInfoSec'
date: 2023/11/20
logsource:
    category: firewall
    product: fortigate
detection:
    selection:
        type: 'utm'
        subtype: 'ips'
        logid|endswith:
            - '16384'   # Attack detected by UDP/TCP signature
            - '16385'   # Attack detected by ICMP signature
            - '16386'   # Attack detected by other signature
        severity:
            - 'critical'
            - 'high'
            - 'medium'
        action: 'detected'
    filter:
        srcip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection and not filter | count(attack) by srcip > 5
fields:
    - user
    - attack
    - url
    - srcip
    - srccountry
    - dstip
falsepositives:
    - Unknown.
level: critical