title: FortiGate UTM IPS Malicious URL
id: 68e06d2a-f167-4c2d-b467-197f1fd5fff9
status: experimental
description: Detects FortiGate NGFW UTM IPS malicious-url activity originating from the private network which is a FortiGate feature that uses a local malicious URL database on the FortiGate to detect drive-by exploits, such as adware that allows automatically downloading of a malicious file when a page loads without the users detection, and the database contians all malicious URLs active in the last one month and all the drive-by exploit URLs actiuve in the last three months, where there are over 1 million URLs in the database at any given time.
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/fortios-log-message-reference/16399/16399-logid-attack-malicious-url
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/419589/ips-configuration-options#Malicious
tags:
    - attack.execution
    - attack.t1059
author: 'Jay Tymchuk (@JayInfoSec)'
date: 2023/11/20
logsource:
    category: firewall
    product: fortigate
detection:
    selection:
        type: 'utm'
        subtype: 'ips'
        eventtype: 'malicious-url'
        logid|endswith:
            - '16399'   # Attack detected by a malicious URL
        severity:
            - 'critical'
            - 'high'
            - 'medium'
        action: 'detected'
        srcip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    filter_src:
        dstip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection and not filter_*
fields:
    - user
    - attack
    - url
    - srcip
    - dstip
falsepositives:
    - Unknown
level: medium