title: FortiGate Internal IPS Signature
id: e390da57-63d1-47c0-8ff4-2833a647d4c4
status: experimental
description: Detects FortiGate NGFW UTM IPS attack signatures originating from the private network systems against other private network systems (internally directed/lateral movement). 
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/986892/sample-logs-by-log-type # Sample Logs
tags:
    - attack.execution
    - attack.t1059
author: '@JayInfoSec'
date: 2023/11/20
logsource:
    category: firewall
    product: fortigate
detection:
    selection:
        type: 'utm'
        subtype:
            - 'ips'
            - 'virus'
            - 'dns'
        attack|contains:
			- 'HackTool'
			- 'HTool'
			- 'HKTL'
			- 'PWCrack'
			- 'SecurityTool' 
			- 'PHP/BackDoor' 
			- 'ASP/BackDoor' 
			- 'JSP/BackDoor' 
			- 'Backdoor.PHP'
			- 'Backdoor.ASP'
			- 'Backdoor.JSP' 
			- 'Webshell'
			- 'DumpCreds'
			- 'MPreter'
			- 'Koadic'
			- 'Razy'
			- 'ATK/'
			- 'Ransom'
			- 'Filecoder'
			- 'Packed.Generic.347'
			- 'Sliver'
			- 'CobaltStr'
			- 'COBEACON'
			- 'Cometer'
			- 'Keylogger'
			- 'MeteTool'
			- 'Meterpreter'
			- 'Metasploit'
			- 'PowerSSH'
			- 'Mimikatz'
			- 'PowerSploit'
			- 'PSWTool'
			- 'PWDump'
			- 'Swrort'
			- 'Rozena'
			- 'Backdoor.Cobalt'
			- 'PShlSpy'
			- 'IISExchgSpawnCMD'
			- 'Exploit.Script.CVE'
			- 'Chopper'
			- 'Brutel'
			- 'BruteR'
			- 'PWSX'
			- 'PWS.'
			- 'Ryuk'
			- 'Cryptor'
			- 'Cryptor'
			- 'Destructor'
			- 'TeslaCrypt'
			- 'Locker'
			- 'Phobos'
			- 'Seatbelt'
			- 'Sbelt'
			- 'SharpDump'
			- 'Tescrypt'
			- 'CRYPTES'
			- 'Krypt'
			- 'GrandCrab' 
			- 'Ryzerlo'
			- 'Blackworm'
    condition: selection
fields:
    - user
    - attack
    - url
    - srcip
    - srccountry
    - dstip
falsepositives:
    - Unknown.
level: critical