title: FortiGate UTM IPS Botnet Outbound Signature
id: 2c2f7f42-4eab-4b51-883c-bf0177acc147
status: experimental
description: Detects FortiGate UTM IPS Botnet C&C signatures, which consolidates multiple botnet protections in the IPS profile, originating from the private network.
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/668865/ips-with-botnet-c-c-ip-blocking
    - https://docs.fortinet.com/document/fortigate/7.4.1/fortios-log-message-reference/16400/16400-logid-attack-botnet-warning
    - https://docs.fortinet.com/document/fortigate/7.4.1/fortios-log-message-reference/16401/16401-logid-attack-botnet-notif
tags:
    - attack.command_and_control
    - attack.t1071.004
author: 'Jay Tymchuk (@JayInfoSec)'
date: 2023/11/20
logsource:
    category: appliance
    product: fortigate
    service: utm
detection:
    selection:
        type: 'utm'
        subtype: 'ips'
        eventtype: 'botnet'
        logid|endswith:
            - '16400'   # Botnet C&C Communication (warning)
            - '16401'   # Botnet C&C Communication (notice)
        severity:
            - 'critical'
            - 'high'
            - 'medium'
        srcip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    filter_dst:
        dstip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection and not filter_*
fields:
    - attack
    - attackid
    - msg
    - service
    - srcip
    - dstip
falsepositives:
    - Unknown.
level: high