title: FortiGate UTM DLP Data Leak Detected
id: c7b980d4-714a-49ae-9bdf-8c524709198d
status: experimental
description: Detects FortiGates NGFW UTM DLP content analysis mechanisims which uses methods like keyword matches, regular expressions, and internal functions to recognize content that matches a companys DLP policy which may indicate potential data leaks.
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/986892/sample-logs-by-log-type # Sample Logs
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/892638/dlp-examples
    - https://www.fortinet.com/resources/cyberglossary/dlp
    - https://docs.fortinet.com/document/fortigate/7.4.2/administration-guide/153498/data-loss-prevention
    - https://community.fortinet.com/t5/FortiGate/Technical-Tip-Configure-Data-Leak-Prevention-DLP/ta-p/196796
    - https://docs.fortinet.com/document/fortigate/7.4.1/fortios-log-message-reference/24576/24576-log-id-dlp-warn
    - https://docs.fortinet.com/document/fortigate/7.4.1/fortios-log-message-reference/24577/24577-log-id-dlp-notif
tags:
    - attack.exfiltration
author: '@JayInfoSec'
date: 2023/11/20
modified: 2024/01/22
logsource:
    category: appliance
    product: fortigate
    service: utm
detection:
    selection:
        type: 'utm'
        subtype: 'dlp'
        logid|endswith:
            - '24576'   # Data leak detected by specified DLP sensor rule
            - '24577'   # Data leak detected by specified DLP sensor rule
        severity:
            - 'critical'
            - 'high'
            - 'medium'
    condition: selection
fields:
    - srcip
    - dstip
    - service
    - filetype
    - hostname
    - url
    - agent
    - httpmethod
    - referralurl
    - filename
falsepositives:
    - Unknown
level: low