title: FortiGate UTM DNS Botnet
id: 33a94167-800a-408f-a8bc-3592ecf6e896
status: experimental
description: Detects attack signatures originating from the private network outbound to the public network. 
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/188826/additional-antiphishing-settings
tags:
    - attack.execution  # example MITRE ATT&CK category
    - attack.t1059      # example MITRE ATT&CK technique id
author: '@JayInfoSec'
date: 2023/11/20
logsource:
    category: firewall
    product: fortigate
detection:
    selection:
        type: 'utm'
        subtype: 'webfilter'
        eventtype: 'antiphishing'
        logid|endswith:
            - '13648'   # Antiphishing matched a URL filter rule without blocking the request.
            - '13649'   # Antiphishing matched a Fortiguard category rule without blocking the request.
            - '13650'   # Antiphishing reached default action without blocking the request.
            - '13651'   # Antiphishing matched a URL filter rule and blocked the request.
            - '13652'   # Antiphishing matched a Fortiguard category rule and blocked the request.
            - '13653'   # Antiphishing reached default action and blocked the request.
        severity:
            - 'critical'
            - 'high'
            - 'medium'
        srcip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    filter_dst:
        dstip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection and not filter_*
fields:
    - user
    - bonetdomain
    - botnetip
    - cat
    - catdesc
falsepositives:
    - Unknown.
level: medium