title: FortiGate UTM Web Filter Antiphishing Activity
id: 33a94167-800a-408f-a8bc-3592ecf6e896
status: experimental
description: Detects FortiGate NGFW UTM web filter antiphishing security profile which scans for corporate credentials submitted to external websites and compares them to creds stored in the domain controller and will block the URL or laret the user if the credentials match.
references:
    -https://docs.fortinet.com/document/fortigate/7.0.0/new-features/188826/enhance-web-filter-antiphishing-profile
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/188826/additional-antiphishing-settings
tags:
    - attack.initial-access
    - attack.t1566
author: '@JayInfoSec'
date: 2023/11/20
logsource:
    category: appliance
    product: fortigate
    service: utm
detection:
    selection:
        type: 'utm'
        subtype: 'webfilter'
        eventtype: 'antiphishing'
        logid|endswith:
            - '13648'   # Antiphishing matched a URL filter rule without blocking the request.
            - '13649'   # Antiphishing matched a Fortiguard category rule without blocking the request.
            - '13650'   # Antiphishing reached default action without blocking the request.
            - '13651'   # Antiphishing matched a URL filter rule and blocked the request.
            - '13652'   # Antiphishing matched a Fortiguard category rule and blocked the request.
            - '13653'   # Antiphishing reached default action and blocked the request.
    condition: selection
fields:
    - action
    - antiphishdc
    - antiphishrule
    - authserver
    - dstip
    - srcip
    - group
    - hostname
    - msg
    - referralurl
    - url
    - user
falsepositives:
    - Unknown
level: medium