title: Cisco eStreamer IPS Event Threat Detection
id: c86b9612-28bf-4f4f-8035-95871c7eaa89
status: test
description: Cisco StealthWatch Command and Cotnrol detections related to network detection and response alerts which should be investigated. 
references:
    - https://
author: Jay Tymchuk
date: 2022/11/23
modified: 2022/11/23
tags:
    - attack.discovery
    - attack.t1069.001
logsource:
    product: cisco_stealthwatch
    category: ndr
    service: stealthawtch
detection:
    selection:
        - recordtypeCategory: 'IPS Event'
        - subtype: 'ips'
        - eventtype: 'signature''
    condition: selection
fields:
    - type
    - subtype
    - severity
    - signature
falsepositives:
    - Vulnerability scanners
level: medium
