title: FortiGate UTM Anomaly Potential Denial of Service Attack
id: 9116ccca-43da-43fc-944e-b3e2333843a7
status: experimental
description: Detects FortiGate NGFW UTM Anomaly events which indicate floods or potential denial of service (DoS) attacks via pre-defined threshold based sensors, which indicates an attacking system starts an abnormally large number of sessions with a target system.
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/771644/dos-policy
    - https://community.fortinet.com/t5/FortiGate/Technical-Tip-DoS-attack-log-according-to-action-set-on-DoS/ta-p/198465
    - https://docs.fortinet.com/document/fortigate/7.4.1/fortios-log-message-reference/18432/18432-logid-attck-anomaly-tcp-udp
    - https://docs.fortinet.com/document/fortigate/7.4.1/fortios-log-message-reference/18433/18433-logid-attck-anomaly-icmp
    - https://docs.fortinet.com/document/fortigate/7.4.1/fortios-log-message-reference/18434/18434-logid-attck-anomaly-others
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/986892/sample-logs-by-log-type # Sample Logs
    - https://docs.fortinet.com/document/fortigate/7.4.1/fortios-log-message-reference/121361/anomaly-log-support-for-cef # CEF Log
tags:
    - attack.impact
    - attack.t1498
author: '@JayInfoSec'
date: 2023/11/20
logsource:
    category: firewall
    product: fortigate
detection:
    selection:
        type: 'utm'
        subtype: 'anomaly'
        logid|endswith:
            - '18432'   # Attack detected by UCP/TCP anomaly
            - '18433'   # Attack detected by ICMP anomaly
            - '18434'   # Attack detected by other anomaly
        action: 'detected'
    condition: selection
fields:
    - user
    - srcip
    - dstip
    - attack
    - service
    - msg
falsepositives:
    - Unknown
level: low