title: FortiGate Inline-Block UTM Virus Signature
id: 7386734f-ab85-4c83-9fed-f98eb947537e
status: experimental
description: Detects attack signatures originating from the private network outbound to the public network.
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/fortios-log-message-reference/422/virus # log reference
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/986892/sample-logs-by-log-type # Sample Logs
    - https://docs.fortinet.com/document/fortisandbox/4.4.0/best-practices/74936/understanding-inline-block-feature # feature description
tags:
    - attack.execution  # example MITRE ATT&CK category
    - attack.t1059      # example MITRE ATT&CK technique id
author: '@JayInfoSec'
date: 2023/11/20
logsource:
    category: firewall
    product: fortigate
detection:
    selection:
        type: 'utm'
        subtype: 'virus'
        eventtype: 'inline-block'
        logid|endswith:
            - '8220'   # File reported infected by Inline Block (warning)
            - '8221'   # File reported infected by Inline Block (notice)
            - '8222'   # MIME data reported infected by Inline Block (warning)
            - '8223'   # MIME data reported infected by Inline Block (notice)
        severity:
            - 'critical'
            - 'high'
            - 'medium'
        srcip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    filter_src:
        dstip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection and not filter_*
fields:
    - user
    - attack
    - url
    - srcip
    - srccountry
    - dstip
falsepositives:
    - Unknown.
level: medium