title: FortiGate Wireless Rogue AP Detected
id: e390da57-63d1-47c0-8ff4-2833a647d4c4
status: experimental
description: Detects potential unauthorized rogue access point activity from FortiGate event logs.
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/986892/sample-logs-by-log-type # Sample log
tags:
    - attack.execution
    - attack.t1059
author: '@JayInfoSec'
date: 2023/11/20
logsource:
    category: firewall
    product: fortigate
detection:
    selection:
        type: 'event'
        subtype: 'wireless'
        logid|endswith:
            - '43521'   # Rogue AP activity
            - '43563'   # Rogue AP detected
            - '43564'   # Rogue AP off air
            - '43565'   # Rogue AP on air
            - '43566'   # Rogue AP off wire
            - '43567'   # Fake AP detected
            - '43568'   # Fake AP on air
            - '43569'   # Rogue AP suppressed
            - '43570'   # Rogue AP unsuppressed
            - '43571'   # Rogue AP change detected
    condition: selection
fields:
    - url
    - status
    - method
    - ui
    - user
    - devid
falsepositives:
    - Unknown.
level: informational