title: FortiGate UTM Virus Multiple Signatures from Private Network
id: 20df04d2-f053-4d55-98ea-cd91de71ea19
status: experimental
description: Detects multiple FortiGate UTM Virus signatures originating from a single source in the private network.
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/986892/sample-logs-by-log-type # Sample Logs
tags:
    - attack.execution  # example MITRE ATT&CK category
    - attack.t1059      # example MITRE ATT&CK technique id
    - car.2014-04-003   # example CAR id
author: '@JayInfoSec'
date: 2023/11/20
logsource:
    category: firewall
    product: fortigate
detection:
    selection:
        type: 'utm'
        subtype: 'virus'
        logid|endswith:
            - <WHAT TO PUT HERE>
        severity:
            - 'critical'
            - 'high'
            - 'medium'
        srcip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection and not filter | count(attack) by srcip > 5
fields:
    - user
    - attack
    - url
    - srcip
    - srccountry
    - dstip
falsepositives:
    - Unknown.
level: critical