title: FortiGate UTM IPS Outbound Signature from Private Network
id: 2c69f9be-3c5a-4232-9af3-d119c7badf0b
status: experimental
description: Detects FortiGate UTM IPS attack signatures originating from the private network outbound to the public network.
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/986892/sample-logs-by-log-type # Sample Logs
tags:
    - attack.initial_access
    - attack.t1190
author: '@JayInfoSec'
date: 2023/11/20
logsource:
    category: firewall
    product: fortigate
detection:
    selection:
        type: 'utm'
        subtype: 'ips'
        eventtype: 'signature'
        logid|endswith:
            - '16384'   # Attack detected by UDP/TCP signature
            - '16385'   # Attack detected by ICMP signature
            - '16386'   # Attack detected by other signature
        severity:
            - 'critical'
            - 'high'
            - 'medium'
        action: 'detected'
        srcip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    filter_src:
        dstip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection and not filter_*
fields:
    - user
    - attack
    - url
    - srcip
    - srccountry
    - dstip
falsepositives:
    - Unknown
level: high