title: Microsoft Exchange Email Inbox Folder Shared With All Users
id: fdf2fa30-fbe0-478a-82af-1cdceda10c38
status: experimental
description: Detects instances where the inbox folder of an Office 365 mailbox is shared with all users within the tenant. This activity is significant as it represents a potential security risk, allowing unauthorized access to sensitive emails. If confirmed malicious, this could lead to data breaches, exfiltration of confidential information, and further compromise through spear-phishing or other malicious activities based on the accessed email content.
references:
    - 
author: 
date: 2024-08-21
tags:
    - 
logsource:
    category: cloud
    product: m365
    service: exchange
detection:
    selection:
        
    condition: selection
falsepositives:
    - Unknown
level: critical
