title: Microsoft Exchange Mailbox Folder Read Permission Granted.
id: 12c982fb-d4f3-419c-b5c6-376899dd3d31
status: experimental
description: DetecDetects instances where read permissions are granted to mailbox folders within an Office 365 environment. This behavior is significant as it may indicate unauthorized access or changes to mailbox folder permissions, potentially exposing sensitive email content. If confirmed malicious, an attacker could gain unauthorized access to read email communications, leading to data breaches or information leakage.s 
references:
    - 
author: 
date: 2024-08-21
tags:
    - 
logsource:
    category: antivirus
    product: aws
    service: activitylogs
detection:
    selection:
        
    condition: selection
falsepositives:
    - Unknown
level: critical
