title: Microsoft Exchange Oauth App Mailbox Access Via Graph Api
id: c749f3b3-5988-45f5-80a1-2f03b444eff1
status: experimental
description: Detects when emails are accessed in Office 365 Exchange via the Microsoft Graph API using the client application ID '00000003-0000-0000-c000-000000000000'. It leverages the 'MailItemsAccessed' operation within the Exchange workload, focusing on OAuth-authenticated applications.
references:
    - 
author: 
date: 2024-08-21
tags:
    - 
logsource:
    category: cloud
    product: m365
    service: exchange
detection:
    selection:
        
    condition: selection
falsepositives:
    - Unknown
level: critical
