title: Microsoft Exchange Mailbox Email Forwarding Enabled
id: fd5682dd-2195-4cce-a8a6-1ddab09c9b28
status: experimental
description: Detects instances where read permissions are assigned to mailbox folders within an Office 365 environment.
references:
    - 
author: 
date: 2024-08-21
tags:
    - 
logsource:
    category: antivirus
    product: aws
    service: activitylogs
detection:
    selection:
        
    condition: selection
falsepositives:
    - Unknown
level: critical
