title: Microsoft Exchange Mailbox Folder Read Permission Assigned
id: 4390511d-1ef5-4380-9c8e-95545f8a5204
status: experimental
description: Detects instances where read permissions are assigned to mailbox folders within an Office 365 environment.
references:
    - 
author: 
date: 2024-08-21
tags:
    - 
logsource:
    category: cloud
    product: m365
    service: exchange
detection:
    selection:
        
    condition: selection
falsepositives:
    - Unknown
level: critical
