title: Microsoft Exchange Dkim Signing Configuration Disabled
id: 3fbf44c7-8738-4708-b32a-4872b2782506
status: expertimental
description: Identifies when a DomainKeys Identified Mail (DKIM) signing configuration is disabled in Microsoft 365. With DKIM in Microsoft 365, messages that are sent from Exchange Online will be cryptographically signed. This will allow the receiving email system to validate that the messages were generated by a server that the organization authorized and were not spoofed.
references:
    - 
author: 
date: 2024-08-21
tags:
    - 
logsource:
    category: antivirus
    product: aws
    service: activitylogs
detection:
    selection:
        
    condition: selection
falsepositives:
    - Unknown
level: critical
