title: Microsoft Exchange New Or Modified Federation Domain
id: a5e20fa8-21f3-499b-8129-585725e9c506
status: experimental
description: Identifies a new or modified federation domain, which can be used to create a trust between O365 and an external identity provider.
references:
    - 
author: 
date: 2024-08-21
tags:
    - 
logsource:
    category: antivirus
    product: aws
    service: activitylogs
detection:
    selection:
        
    condition: selection
falsepositives:
    - Unknown
level: critical
