title: Microsoft Exchange Safe Attachment Rule Disabled
id: 7f8289c9-59b6-462a-830c-acd61b8351e6
status: experimental
description: Identifies when a safe attachment rule is disabled in Microsoft 365. Safe attachment rules can extend malware protections to include routing all messages and attachments without a known malware signature to a special hypervisor environment. An adversary or insider threat may disable a safe attachment rule to exfiltrate data or evade defenses.
references:
    - 
author: 
date: 2024-08-21
tags:
    - 
logsource:
    category: antivirus
    product: aws
    service: activitylogs
detection:
    selection:
        
    condition: selection
falsepositives:
    - Unknown
level: critical
