title: Microsoft 365 eDiscovery Content Search Started Or Exported
id: ddf5edcb-651a-4080-a674-40e830516f65
status: experimental
description: Detects instances where a user has initiated an eDiscovery search or exported a PST file in an Office 365 environment.
references:
    - https://research.splunk.com/cloud/5f694cc4-a678-4a60-9410-bffca1b647dc/
author: Jay Tymchuk '@JayInfoSec'
date: 2024-08-20
tags:
    - attack.collection
    - attack.t1114
logsource:
    category: cloud
    product: m365
    service: securitycompliancecenter
detection:
    selection:
        Workload: 'SecurityComplianceCenter'
        Category: "ThreatManagement"
        Operation: 'AlertTriggered'
        eventName: 'eDiscovery search started or exported.'
    condition: selection
falsepositives:
    - Compliance content searches may be executed for legitimate purposes, filter as needed.
level: medium
