title: Microsoft 365 User Restricted From Sending Email
id: 82fb450f-1e62-446b-9930-e2cb59f5ae24
status: experimental
description: Identifies when a user has been restricted from sending email due to exceeding sending limits of the service policies per the Security Compliance Center.
references:
    - https://www.elastic.co/guide/en/security/current/microsoft-365-user-restricted-from-sending-email.html
    - https://github.com/SigmaHQ/sigma/blob/0504f18f6b657ef7632b1849a257fb9134f43657/rules/cloud/m365/threat_management/microsoft365_user_restricted_from_sending_email.yml
    - https://learn.microsoft.com/en-us/defender-cloud-apps/anomaly-detection-policy
    - https://learn.microsoft.com/en-us/defender-cloud-apps/policy-template-reference
author: Jay Tymchuk '@JayInfoSec'
date: 2024-08-20
tags:
    - attack.initial-access
    - attack.t1078
logsource:
    category: cloud
    product: m365
    service: securitycompliancecenter
detection:
    selection:
        Workload: 'SecurityComplianceCenter'
        Category: "ThreatManagement"
        Operation: 'AlertTriggered'
        eventName: 'User restricted from sending email'
    condition: selection
falsepositives:
    - A user sending emails using personal distribution folders may trigger the event.
level: medium
