title: Microsoft 365 Impossible Travel Activity
id: a40f8cfa-55cc-4eec-a2a9-9244642575c8
status: experimental
description: Identifies when a Microsoft Cloud App Security reported a risky sign-in attempt due to a login associated with an impossible travel.
references:
    - https://www.elastic.co/guide/en/security/current/microsoft-365-impossible-travel-activity.html
    - https://learn.microsoft.com/en-us/defender-cloud-apps/anomaly-detection-policy
    - https://learn.microsoft.com/en-us/defender-cloud-apps/policy-template-reference
author: '@JayInfoSec'
date: 2024-08-20
tags:
    - attack.initial_access
    - attack.t1078
logsource:
    category: cloud
    product: m365
    service: securitycompliancecenter
detection:
    selection:
        Workload: 'SecurityComplianceCenter'
        Category: "ThreatManagement"
        Operation: 'AlertTriggered'
        eventName: 'Impossible travel activity.'
    condition: selection
falsepositives:
    - User using a VPN may lead to false positives.
level: medium
