title: Microsoft 365 Sharepoint Object Shared With Guest
id: 6792c5fd-92df-4159-ab06-ccd716a26afb
status: experimental
description: Detect when a user shares a Microsoft 365 Sharepoint document with a guest.
references:
    - https://docs.datadoghq.com/security/default_rules/m365-sharepoint-shared-file-with-guest/
author: '@JayInfoSec'
date: 2024-08-20
tags:
    - attack.collection
    - attack.t1213
logsource:
    category: cloud
    product: m365
detection:
    selection:
        Workload:
            - 'SharePoint'
            - 'OneDrive'
        Operation: 'SharingInvitationCreated'
        TargetUserOrGroupType: 'Guest'
    condition: selection
falsepositives:
    - Unknown
level: low
