title: FortiGate UTM DLP Outbound Data Leak Detected
id: c7b980d4-714a-49ae-9bdf-8c524709198d
status: experimental
description: Detects potential data leaks via FortiGates UTM DLP content analysis mechanisims which uses methods like keyword matches, regular expressions, and internal functions to recognize content that matches a companys DLP policy.
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/986892/sample-logs-by-log-type # Sample Logs
    - https://www.fortinet.com/resources/cyberglossary/dlp
    - https://docs.fortinet.com/document/fortigate/7.4.2/administration-guide/153498/data-loss-prevention
    - https://community.fortinet.com/t5/FortiGate/Technical-Tip-Configure-Data-Leak-Prevention-DLP/ta-p/196796
tags:
    - attack.exfiltration
author: '@JayInfoSec'
date: 2023/11/20
modified: 2024/01/22
logsource:
    category: firewall
    product: fortigate    # FortiOS 7.4
detection:
    selection:
        type: 'utm'
        subtype: 'dlp'
        logid|endswith:
            - '24576'   # Data leak detected by specified DLP sensor rule
            - '24577'   # Data leak detected by specified DLP sensor rule
        severity:
            - 'critical'
            - 'high'
            - 'medium'
        srcip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    filter_dst:
        dstip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection and not filter_*
fields:
    - srcip
    - dstip
    - service
    - filetype
    - hostname
    - url
    - agent
    - httpmethod
    - referralurl
    - filename
falsepositives:
    - Unknown
level: low