title: ExtraHop Medium Risk Alert
id: 0ac365b2-62c3-42a4-a81d-3a8fd96aa671
status: unsupported
description: |
    Detects any detection from ExtraHop Reveal(x) 360 Network Detection and Response (NDR) platform.
    This rule specifically monitors any medium risk detection, identified by a risk score of 30 and below.
references:
    - https://docs.extrahop.com/9.8/detections-overview/
    - https://docs.extrahop.com/9.8/eh-system-user-guide/#alerts
    - https://learn.extrahop.com/alerts-course
    - https://docs.extrahop.com/9.8/detections-faq/#:~:text=Risk%20scores%20are%20grouped%20into,Yellow%20%3D%201%2D30
author: Jay Tymchuk '@JayInfoSec'
date: 2025-02-13
tags:
    - attack.execution
    - attack.lateral-movement
    - attack.persistence
    - attack.command-and-control
    - attack.discovery
logsource:
    product: extrahop
detection:
    selection:
        risk_score: "<= 30"              # less than or equal to a risk score of 30
    condition: selection
falsepositives:
    - Unlikely
level: medium