title: Prisma Cloud Anomaly Alert
id: b5a6c3d7-7778-4f0d-93bb-681ebffd9541
status: unsupported
description: |
    Detects Prisma Cloud Anomaly alerts which are of critical, high, medium or low severity.
    Anomaly policies use audit logs and network flow logs to help you identify unusual network and user activity for all users, and are especially critical for privileged users and assumed roles where detecting unusual activity may indicate the first steps in a potential misuse or account compromise. These policies rely on threat feeds to resolve IP addresses to geo-locations and perform user entity behavior analysis (UEBA). When Prisma Cloud identifies a suspicious IP address, the threat feed enables you to classify and view more information on the malicious IP addresses with which the suspicious IP address is communicating, so you can quickly figure out which alerts to pay attention to and act on.
references:
    - https://docs.prismacloud.io/en/enterprise-edition/content-collections/alerts/alerts
    - https://docs.prismacloud.io/en/enterprise-edition/content-collections/governance/anomaly-policies
    - https://docs.prismacloud.io/en/enterprise-edition/content-collections/administration/anomalies/anomalies
author: Jay Tymchuk '@JayInfoSec'
date: 2025-02-13
tags:
    - attack.initial-access
    - attack.execution
    - attack.persistence
    - attack.defense-evasion
    - attack.credential-access
    - attack.discovery
    - attack.lateral-movement
    - attack.collection
    - attack.exfiltration
    - attack.impact
logsource:
    category: cloud
    product: prisma_access
detection:
    selection:
        reason: 'NEW_ALERT'
        policyType: "anomaly"
        severity:
            - critical
            - medium
            - high
            - low
    condition: selection
falsepositives:
    - Unknown
level: high
