title: SEP Network Detection - Fake App Signature
id: 816d8dd3-0e6a-4db0-b401-a4ac8d4fba01
status: experimental
description: Detects Symantec Endpoint Protection host network detection event indicating an 'Fake App' signature.
references:
    - https://icd-schema.symantec.com/type/8040
    - https://www.broadcom.com/support/security-center/attacksignatures?
author: Jay Tymchuk
date: 2024/01/30
tags:
    - attack.initial_access
logsource:
    category: antivirus
    product: symantec_endpoint_protection
detection:
    selection:
        event_id|startswith: '8040'
        threat|startswith: 'Fake'
        device_ip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection
falsepositives:
    - Filter any external vulnerability scanners.
    - Filter any Attack signatures which are not relevant in the environment.
level: medium
