title: SEP Network Detection - Malicious Sites Signature
id: 75664dc6-1c61-46d0-b309-f139c78ee1d9
status: experimental
description: Detects Symantec Endpoint Protection host network detection event indicating an 'Malicious URL' signature.
references:
    - https://icd-schema.symantec.com/type/8040
    - https://www.broadcom.com/support/security-center/attacksignatures?
author: Jay Tymchuk
date: 2024/01/30
tags:
    - attack.initial_access
logsource:
    category: antivirus
    product: symantec_endpoint_protection
detection:
    selection:
        event_id|startswith: '8040'
        threat|startswith:
            - 'Malicious Site'
            - 'URL'
        device_ip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection
falsepositives:
    - Filter any external vulnerability scanners.
    - Filter any Attack signatures which are not relevant in the environment.
level: medium
