title: Palo Alto Networks WildFire Signature
id: 15c81991-5cd7-4e4d-b61b-3aaa8641b209
status: test
description: Detects a Palo Alto Networks WildFire threat signature.
references:
    - https://threatvault.paloaltonetworks.com/
    - https://www.paloaltonetworks.com/blog/2015/09/network-ips-tuning-guide/
    - https://docs.paloaltonetworks.com/advanced-threat-prevention/administration/threat-prevention/threat-signature-categories
    - https://docs.paloaltonetworks.com/pan-os/10-2/pan-os-admin/policy/security-profiles
    - https://docs.paloaltonetworks.com/pan-os/10-2/pan-os-admin/monitoring/use-syslog-for-monitoring/syslog-field-descriptions/threat-log-fields
    - https://docs.paloaltonetworks.com/best-practices/internet-gateway-best-practices/best-practice-internet-gateway-security-policy/transition-safely-to-best-practice-security-profiles/transition-vulnerability-protection-profiles-safely-to-best-practices
author: Jay Tymchuk
date: 2024/10/03
modified: 2024/10/03
tags:
    - attack.execution
logsource:
    category: appliance
    product: paloalto
    service: threat
detection:
    selection:
        type: 'THREAT'
        subtype:
            - 'wildfire'
        severity:
            - 'critical'
            - 'high'
            - 'medium'
            - 'low'
    filter_blocked:
        action:
            - 'deny'
            - 'drop'
            - 'reset-client'
            - 'reset-server'
            - 'reset-both'
            - 'block-url'
            - 'block-ip'
            - 'random-drop'
            - 'sinkhole'
            - 'block'
    filter_private:
        srcip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection and not (filter_blocked and not filter_private)
fields:
    - type
    - subtype
    - thr_category
    - threatid
    - misc
    - severity
    - action
    - src
    - dst
falsepositives:
    - Vulnerability scanners and misconfigured systems.
level: medium
