title: Palo Alto Networks Highly Relevant Threat Signature
id: e390da57-63d1-47c0-8ff4-28s3a647d4c4
status: experimental
description: Detects attack signatures originating from the private network systems against other private network systems (internally directed/lateral movement). 
references:
    - https://threatvault.paloaltonetworks.com/
    - https://github.com/BushidoUK/Ransomware-Tool-Matrix/blob/5bdf4cd8003d02b03e3b73e6d101a760a6606bf6/Tools/AllTools.csv
    - https://www.nextron-systems.com/2024/07/17/antivirus-event-analysis-cheat-sheet-v1-13-0/
tags:
    - attack.execution  # example MITRE ATT&CK category
    - attack.t1059      # example MITRE ATT&CK technique id
    - car.2014-04-003   # example CAR id
author: '@JayInfoSec'
date: 2023/11/20
logsource:
    category: appliance
    product: paloalto
    service: threat
detection:
    selection:
        type: 'utm'
        subtype:
            - 'vulnerability'
            - 'spyware'
            - 'virus'
        threatid|contains:
            - 'Action1'
            - 'ADExplorer'
            - 'AdFind'
            - 'ADRecon'
            - 'Advanced IP Scanner'
            - 'Advanced Port Scanner'
            - 'Angry IP Scanner'
            - 'Anonfiles'
            - 'AnyDesk'
            - 'ASG Remote Desktop'
            - 'ASP/BackDoor'
            - 'Atera'
            - 'ATK/'
            - 'Avast Anti-Rootkit driver'
            - 'AWS Systems Manager Inventory'
            - 'aws_consoler'
            - 'Backdoor.ASP'
            - 'Backdoor.Cobalt'
            - 'Backdoor.JSP'
            - 'Backdoor.PHP'
            - 'Backstab'
            - 'Bashupload'
            - 'BCDEdit'
            - 'BeAnywhere'
            - 'Bedevil'
            - 'BetterSafetyKatz'
            - 'BITSAdmin'
            - 'Blackworm'
            - 'Bloodhound'
            - 'Brute Ratel C4'
            - 'Brutel'
            - 'BruteR'
            - 'BurpSuite'
            - 'Catbox[.]moe'
            - 'Cent Browser'
            - 'Chashell'
            - 'Chisel'
            - 'Chopper'
            - 'Chrome Remote Desktop'
            - 'CIMplant'
            - 'Cloudflared'
            - 'Cobalt'
            - 'Cobalt Strike'
            - 'COBEACON'
            - 'Cometer'
            - 'ConPtyShell'
            - 'CrackMapExec'
            - 'CRYPTES'
            - 'Cryptor'
            - 'Cyberduck'
            - 'Defender Control'
            - 'Dell Client driver'
            - 'Destructor'
            - 'Domotz'
            - 'DonPAPI'
            - 'Dropbox'
            - 'Dropfiles'
            - 'Dropmefiles'
            - 'Dsquery'
            - 'DumpCreds'
            - 'DWAgent'
            - 'EMCO UnLock IT'
            - 'Eraser'
            - 'Evilginx2'
            - 'Exploit.Script.CVE'
            - 'FastReverseProxy'
            - 'File[.]io'
            - 'Filecoder'
            - 'FileShredder'
            - 'FileZilla'
            - 'FixMeIt'
            - 'Fleetdeck'
            - 'FreeFileSync'
            - 'FRP.'
            - 'GIGABYTE Motherboard driver'
            - 'GitGuardian'
            - 'GMER'
            - 'Godzilla Web Shell'
            - 'Gofile[.io]'
            - 'GrabChrome'
            - 'GrabFF'
            - 'GrandCrab HackTool'
            - 'HKTL'
            - 'HTool'
            - 'IISExchgSpawnCMD'
            - 'Impacket'
            - 'IOBit'
            - 'ITarian'
            - 'Jecretz'
            - 'JSP/BackDoor'
            - 'KeeThief'
            - 'Kerbrute'
            - 'Keylogger'
            - 'Koadic'
            - 'Krypt'
            - 'Lansweeper'
            - 'LAPS Toolkit'
            - 'LaZagne'
            - 'Level.io'
            - 'Ligolo'
            - 'LINpeas'
            - 'Locker'
            - 'LogMeIn'
            - 'LostMyPassword'
            - 'MAGNET RAM Capture'
            - 'ManageEngine LANDESK'
            - 'ManageEngineRMM'
            - 'Masscan'
            - 'MEGA'
            - 'MeshAgent'
            - 'Metasploit'
            - 'Meterpreter'
            - 'MeteTool'
            - 'MicroBurst'
            - 'Mimikatz'
            - 'Minidump'
            - 'MIT Kerberos Ticket Manager'
            - 'MobaXterm'
            - 'Mpreter'
            - 'MsfShell'
            - 'MSI Afterburner driver'
            - 'N-Able'
            - 'Nbtscan'
            - 'NetSupport'
            - 'Ngrok'
            - 'Nighthawk'
            - 'NirSoft BulletsPassView'
            - 'NirSoft ChromePass'
            - 'NirSoft Dialupass'
            - 'NirSoft ExtPassword'
            - 'NirSoft IEPassView (iepv)'
            - 'NirSoft MailPassView'
            - 'NirSoft Netpass'
            - 'NirSoft OperaPassView'
            - 'NirSoft RemoteDesktopPassView (rdpv)'
            - 'NirSoft RouterPassView'
            - 'NirSoft SniffPass'
            - 'NirSoft VNCPassView'
            - 'NirSoft WebBrowserPassView'
            - 'NirSoft WinLister'
            - 'NirSoft WirelessKeyView'
            - 'Nmap'
            - 'Nping'
            - 'NSOCKS'
            - 'NSudo'
            - 'NTDS Utility'
            - 'OpenSSH'
            - 'Packed.Generic.347'
            - 'Pacu'
            - 'PAExec'
            - 'Parsec'
            - 'PasswordFox'
            - 'PCHunter'
            - 'pCloud'
            - 'PDQ Deploy'
            - 'PDQ Inventory'
            - 'PentestPowerShell'
            - 'Phobos'
            - 'PHP/BackDoor'
            - 'PingCastle'
            - 'Plink'
            - 'Potato'
            - 'PowerShell Empire'
            - 'PowerSploit'
            - 'PowerSSH'
            - 'PowerTool'
            - 'PowerView'
            - 'PrivatLab'
            - 'ProcDump'
            - 'Process Explorer'
            - 'ProcessHacker'
            - 'ProtonMail'
            - 'Proxifier'
            - 'PSCP'
            - 'PsExec'
            - 'PshlSpy'
            - 'PsInfo'
            - 'PSNmap'
            - 'PSWTool'
            - 'Pulseway'
            - 'PWCrack'
            - 'PWDump'
            - 'PwnTools'
            - 'PWS.'
            - 'PWSX'
            - 'Qaz[.]im'
            - 'Radmin'
            - 'Ransom'
            - 'Razy'
            - 'RClone'
            - 'RDP Recognizer'
            - 'ReconFTW'
            - 'Remote Manipulator System (RMS)'
            - 'RemotePC'
            - 'RemoteUtilities'
            - 'Responder'
            - 'Restic'
            - 'Router Scan'
            - 'Rozena'
            - 'RPort'
            - 'RSAT'
            - 'Rsocks'
            - 'Rubeus'
            - 'RustDesk'
            - 'RustScan'
            - 'RVTools'
            - 'Ryuk'
            - 'Ryzerlo'
            - 'S3 Browser'
            - 'Sbelt'
            - 'ScreenConnect'
            - 'Seatbelt'
            - 'SecretServerSecretStealer'
            - 'SecurityTool'
            - 'Sendspace'
            - 'ServiceControl (sc.exe)'
            - 'SessionGopher'
            - 'share[.]riseup[.]net'
            - 'ShareFinder'
            - 'SharpChrome'
            - 'SharpDump'
            - 'SharpHound'
            - 'SharpKatz'
            - 'SharpShares'
            - 'SharpSploit'
            - 'SharpView'
            - 'Shellcode'
            - 'SimpleHelp'
            - 'Sliver'
            - 'Snaffler'
            - 'Socat'
            - 'SoftPerfect LanSearchPro'
            - 'SoftPerfect NetScan'
            - 'Sorillus'
            - 'Splashtop'
            - 'Splinter'
            - 'Sshimpanzee'
            - 'SuperOps'
            - 'Supremo'
            - 'Swrort'
            - 'Syncro'
            - 'TacticalRMM'
            - 'Tailscale'
            - 'TDSSKiller'
            - 'TeamViewer'
            - 'Temp.sh'
            - 'Tempsend'
            - 'Termite'
            - 'Tescrypt'
            - 'TeslaCrypt'
            - 'ThreatFire System Monitor driver'
            - 'ThunderShell'
            - 'TightVNC'
            - 'TinyMet'
            - 'Transfer[.]sh'
            - 'Transfert-my-files'
            - 'TrendMicro Basecamp'
            - 'TrueSocks'
            - 'Trufflehog'
            - 'TurtleLoader'
            - 'Twingate'
            - 'TXPortMap'
            - 'UFile'
            - 'Universal Virus Sniffer'
            - 'Valyria'
            - 'Veeam-Get-Creds'
            - 'VirtualBox'
            - 'VMware PowerCLI'
            - 'Volatility'
            - 'Webshell'
            - 'Windows Event Utility'
            - 'WinExe'
            - 'WinPEAS'
            - 'WinSCP'
            - 'WMIC'
            - 'Wstunnel'
            - 'XenArmor'
            - 'YDArk'
            - 'Zemana Anti-Rootkit driver'
            - 'ZeroTier'
            - 'ZohoAssist'
    filter_blocked:
        action:
            - 'deny'
            - 'drop'
            - 'reset-client'
            - 'reset-server'
            - 'reset-both'
            - 'block-url'
            - 'block-ip'
            - 'random-drop'
            - 'sinkhole'
            - 'block'
    filter_private:
        srcip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection and not (filter_blocked and not filter_private)
fields:
    - type
    - subtype
    - thr_category
    - threatid
    - misc
    - severity
    - action
    - src
    - dst
falsepositives:
    - Unknown.
level: critical