title: Palo Alto Networks Highly Relevant Threat Signature
id: e390da57-63d1-47c0-8ff4-28s3a647d4c4
status: experimental
description: Detects attack signatures originating from the private network systems against other private network systems (internally directed/lateral movement). 
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/986892/sample-logs-by-log-type # Sample Logs
tags:
    - attack.execution  # example MITRE ATT&CK category
    - attack.t1059      # example MITRE ATT&CK technique id
    - car.2014-04-003   # example CAR id
author: '@JayInfoSec'
date: 2023/11/20
logsource:                      
    category: firewall 
    product: fortigate
detection:
    selection:
        type: 'utm'
        subtype:
            - 'vulnerability'
            - 'spyware'
            - 'virus'
        threatid|contains:
            - 'Cobalt Strike'
            - 'BloodHound'
            - 'SharpHound'
            - 'ADFind'
    condition: selection
fields:
    - user
    - attack
    - url
    - srcip
    - srccountry
    - dstip
falsepositives:
    - Unknown.
level: critical