title: Palo Alto Networks Zone Protection Signature
id: fffcf62a-6b41-4c0f-8f1e-6f1d4c822eb5
status: test
description: Detects a Palo Alto Networks Zone Protection threat signature.
references:
    - https://threatvault.paloaltonetworks.com/
    - https://www.paloaltonetworks.com/blog/2015/09/network-ips-tuning-guide/
author: Jay Tymchuk
date: 2024/10/03
modified: 2024/10/03
tags:
    - attack.execution
logsource:
    product: palo_alto
    category: firewall
detection:
    selection:
        type: 'THREAT'
        subtype: 'zone-protection'
        severity:
            - 'critical'
            - 'high'
            - 'medium'
            - 'low'
    condition: selection
fields:
    - type
    - subtype
    - severity
    - threatid
    - misc
    - src
    - dst
falsepositives:
    - Vulnerability scanners and misconfigured systems.
level: medium
