title: FortiGate UTM WAF Custom Signature
id: 3dd2b50f-1419-4738-bbff-ee2a1faac17a
status: experimental
description: Detects a FortiGate NGFW UTM web application firewall (WAF) security profile blocked or allowed an application by custom signature.
references:
    - https://docs.fortinet.com/document/fortigate/7.6.0/administration-guide/233445/blocking-applications-with-custom-signatures
    - https://docs.fortinet.com/document/fortigate/6.2.2/fortios-log-message-reference/517224/30251-logid-waf-custom-signature-block
    - https://docs.fortinet.com/document/fortigate/6.2.2/fortios-log-message-reference/686130/30252-logid-waf-custom-signature-pass
tags:
    - attack.execution
author: '@JayInfoSec'
date: 2023/11/20
logsource:
    category: appliance
    product: fortigate
    service: utm
detection:
    selection:
        type: 'utm'
        subtype: 'waf'
        eventtype: 'waf-custom-signature'
        logid|endswith:
            - '30251'   # Web application firewall blocked application by custom signature
            - '30252'   # Web application firewall allowed application by custom signaturee
        severity:
            - 'critical'
            - 'high'
            - 'medium'
        srcip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    filter_src:
        dstip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection and not filter_*
fields:
    - action
    - appcat
    - app
    - hostname
    - agent
    - url
    - srcip
    - dstip
falsepositives:
    - Unknown
level: medium