title: SEP Network Detection - System Infected Signature
id: 596321f0-69e6-47da-9c8b-fa57d6fd0464
status: experimental
description: Detects Symantec Endpoint Protection host network detection event indicating an 'System Infected' signature.
references:
    - https://icd-schema.symantec.com/type/8040
    - https://www.broadcom.com/support/security-center/attacksignatures?
author: Jay Tymchuk
date: 2024/01/30
tags:
    - attack.initial_access
logsource:
    category: antivirus
    product: symantec_endpoint_protection
detection:
    selection:
        event_id|startswith: '8040'
        threat|startswith: 'System Infected'
        device_ip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection
falsepositives:
    - Filter any external vulnerability scanners.
    - Filter any Attack signatures which are not relevant in the environment.
level: medium
