title: FortiGate Infected UTM Virus Infected File
id: 070d9b15-b502-4d76-b27c-ef035c2ed635
status: experimental
description: Detects FortiGate NGFW UTM Virus security profiles detecting an infected file.
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/986892/sample-logs-by-log-type # Sample Logs
tags:
    - attack.execution
    - attack.t1059
author: '@JayInfoSec'
date: 2023/11/20
logsource:
    category: appliance
    product: fortigate
    service: utm
detection:
    selection:
        type: 'utm'
        subtype: 'virus'
        eventtype: 'infected'
        logid|endswith:
            - '8192'   # Infected file detected by the FortiGate unit and blocked
            - '8193'   # Infected file detected by the FortiGate unit and it passed
            - '8194'   # MIME header detected to have a virus and blocked
            - '8195'   # MIME header infected and passed
            - '9234'   # File reported infected by FortiSandbox (warning)
            - '9235'   # File reported infected by FortiSandbox (notice)
            - '9236'   # File reported infected by FortiSandbox (warning)
            - '9237'   # File reported infected by FortiSandbox (notice)
        severity:
            - 'critical'
            - 'high'
            - 'medium'
        srcip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection
fields:
    - user
    - attack
    - url
    - srcip
    - srccountry
    - dstip
falsepositives:
    - Unknown
level: medium