title: FortiGate UTM Virus Multiple Signatures from Private Network
id: 20df04d2-f053-4d55-98ea-cd91de71ea19
status: experimental
description: Detects multiple FortiGate NGFW UTM Virus signatures originating from a single source in the private network which may indicate an infection on multople devices.
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/986892/sample-logs-by-log-type # Sample Logs
tags:
    - attack.execution
    - attack.t1059
author: '@JayInfoSec'
date: 2023/11/20
logsource:
    category: firewall
    product: fortigate
detection:
    selection:
        type: 'utm'
        subtype: 'virus'
        severity:
            - 'critical'
            - 'high'
            - 'medium'
        srcip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '19    - url
2.168.0.0/16'
    condition: selection and not filter | count(attack) by srcip > 5
fields:
    - user
    - attack
    - url
    - srcip
    - srccountry
    - dstip
falsepositives:
    - Unknown.
level: critical