title: FortiGate UTM Virus MIMEFragmented Signature
id: 66167fe2-194a-462b-afe9-53d2c73eda4f
status: experimental
description: Detects FortiGate NGFW UTM Virus security profiles blocking a MIME file containing a virus.
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/986892/sample-logs-by-log-type # Sample Logs
tags:
    - attack.execution
    - attack.t1059
author: '@JayInfoSec'
date: 2023/11/20
logsource:
    category: firewall
    product: fortigate
detection:
    selection:
        type: 'utm'
        subtype: 'virus'
        eventtype: 'mimefragmented'
        logid|endswith:
            - '8450'    # FortiGate unit blocked a file because it contains a virus (MIME)
            - '8451'    # FortiGate unit blocked a file because it contains a virus (MIME)
        severity:
            - 'critical'
            - 'high'
            - 'medium'
        srcip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection
fields:
    - user
    - attack
    - url
    - srcip
    - srccountry
    - dstip
falsepositives:
    - Unknown.
level: medium