title: Microsoft 365 OneDrive or SharePoint Anonymous Link Created
id: 788617ce-314e-4c23-9f64-a1683feae862
status: experimental
description: Detect when a user creates an anonymous link for a Microsoft 365 document in OneDrive. This would allow any unauthenticated user to access this document, if they had the link. 
references:
    - https://docs.datadoghq.com/security/default_rules/m365-onedrive-anonymouslink/
author: @JayInfoSec
date: 2024-08-20
tags:
    - attack.collection
logsource:
    category: cloud
    product: o365
    service: onedrive
detection:
    selection:
        Workload: 
            - 'OneDrive'
            - 'SharePoint'
        Operation: 'AnonymousLinkCreated'
    condition: selection
falsepositives:
    - Unlikely
level: medium

