title: Palo Alto Networks Antispyware Signature
id: 61e9cd7f-a551-4848-bff1-d222f5220d66
status: test
description: Detects a Palo Alto Networks antispyware threat signature.
references:
    - https://threatvault.paloaltonetworks.com/
    - https://www.paloaltonetworks.com/blog/2015/09/network-ips-tuning-guide/
author: Jay Tymchuk
date: 2024/10/03
modified: 2024/10/03
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    product: palo_alto
    category: firewall
detection:
    selection:
        type: 'THREAT'
        subtype: 'spyware'
        severity:
            - 'critical'
            - 'high'
            - 'medium'
    condition: selection
fields:
    - type
    - subtype
    - severity
    - threatid
    - misc
    - src
    - dst
falsepositives:
    - Possible false positive scenarios include, but are not limited to, vulnerability scanners and misconfigured systems.
level: medium
