title: Palo Alto Networks WildFire Signature
id: 15c81991-5cd7-4e4d-b61b-3aaa8641b209
status: test
description: Detects a Palo Alto Networks WildFire threat signature.
references:
    - https://threatvault.paloaltonetworks.com/
    - https://www.paloaltonetworks.com/blog/2015/09/network-ips-tuning-guide/
author: Jay Tymchuk
date: 2024/10/03
modified: 2024/10/03
tags:
    - attack.execution
logsource:
    product: palo_alto
    category: firewall
detection:
    selection:
        type: 'THREAT'
        subtype: 
            - 'wildfire'
            - 'wildfire-virus'
        severity:
            - 'critical'
            - 'high'
            - 'medium'
            - 'low'
    condition: selection
fields:
    - type
    - subtype
    - severity
    - threatid
    - misc
    - src
    - dst
falsepositives:
    - Possible false positive scenarios include, but are not limited to, vulnerability scanners and misconfigured systems.
level: medium
