title: Firewall Port Protocol Mismatch
id: 1b297326-0d83-430a-9afb-ec52ef4ef302
status: experimental
description: Detects port and protocol mismatch in network firewall logs which may indicate suspicious activity.
references:
    - https://research.splunk.com/network/54dc1265-2f74-4b6d-b30d-49eb506a31b3/
    - https://www.infosecinstitute.com/resources/threat-hunting/threat-hunting-for-mismatched-port-application-traffic/
author: 
date: 2024-10-10
tags:
    - attack.command-and-control
logsource:
    category: network
    service: firewall
detection:
    selection_1:
        network.transport: "tcp"
        network.protocol: "http"
    filter_1:
        destination.port: "80"
    selection_2:
        network.transport: "tcp"
        network.protocol: "https"
    filter_2:
        destination.port: "443"
    selection_3:
        network.transport: "udp"
        network.protocol: "dns"
    filter_3:
        destination.port: "53"
    selection_4:
        network.transport: "tcp"
        network.protocol: "smtp"
    filter_4:
        destination.port: "25"
    selection_5:
        network.transport: "tcp"
        network.protocol: "pop3"
    filter_5:
        destination.port: "110"
    selection_6:
        network.transport: "tcp"
        network.protocol: "imap"
    filter_6:
        destination.port: "143"
    selection_7:
        network.transport: "tcp"
        network.protocol: "ftp"
    filter_7:
        destination.port: "21"
    selection_8:
        network.transport: "tcp"
        network.protocol: "ssh"
    filter_8:
        destination.port: "22"
    selection_9:
        network.transport: "tcp"
        network.protocol: "telnet"
    filter_9:
        destination.port: "23"
    selection_10:
        network.transport: "udp"
        network.protocol: "snmp"
    filter_10:
        destination.port: "161"
    selection_11:
        network.transport: "tcp"
        network.protocol: "rdp"
    filter_11:
        destination.port: "3389"
    selection_12:
        network.transport: "tcp"
        network.protocol: "ldap"
    filter_12:
        destination.port: "389"
    selection_13:
        network.transport: "tcp"
        network.protocol: "ldaps"
    filter_13:
        destination.port: "636"
    selection_14:
        network.transport: "udp"
        network.protocol: "ntp"
    filter_14:
        destination.port: "123"
    selection_15:
        network.transport: "tcp"
        network.protocol: "mysql"
    filter_15:
        destination.port: "3306"
    selection_16:
        network.transport: "tcp"
        network.protocol: "postgresql"
    filter_16:
        destination.port: "5432"
    selection_17:
        network.transport: "tcp"
        network.protocol: "smb"
    filter_17:
        destination.port: "445"
    selection_18:
        network.transport: "udp"
        network.protocol: "tftp"
    filter_18:
        destination.port: "69"
    selection_19:
        network.transport: "tcp"
        network.protocol: "kerberos"
    filter_19:
        destination.port: "88"
    selection_20:
        network.transport: "udp"
        network.protocol: "ikev2"
    filter_20:
        destination.port: "500"
    condition: (selection_1 and not filter_1) or (selection_2 and not filter_2) or  (selection_3 and not filter_3) or (selection_4 and not filter_4) or (selection_5 and not filter_5) or (selection_6 and not filter_6) or (selection_7 and not filter_7) or (selection_8 and not filter_8) or (selection_9 and not filter_9) or (selection_10 and not filter_10) or (selection_11 and not filter_11) or (selection_12 and not filter_12) or (selection_13 and not filter_13) or (selection_14 and not filter_14) or (selection_15 and not filter_15) or (selection_16 and not filter_16) or (selection_17 and not filter_17) or (selection_18 and not filter_18) or (selection_19 and not filter_19) or (selection_20 and not filter_20)
falsepositives:
    - Misconfigured network devices
    - Legitimate services using non-standard ports
level: low
