title: FortiGate UTM WAF Custom Signature
id: 3dd2b50f-1419-4738-bbff-ee2a1faac17a
status: experimental
description: Detects attack signatures originating from the private network outbound to the public network.
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/952611/icap
tags:
    - attack.execution  # example MITRE ATT&CK category
    - attack.t1059      # example MITRE ATT&CK technique id
author: '@JayInfoSec'
date: 2023/11/20
logsource:
    category: firewall
    product: fortigate
detection:
    selection:
        type: 'utm'
        subtype: 'waf'
        eventtype: 'waf-custom-signature'
        logid|endswith:
            - '30251'   # Web application firewall blocked application by custom signature
            - '30252'   # Web application firewall allowed application by custom signaturee
        severity:
            - 'critical'
            - 'high'
            - 'medium'
        srcip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    filter_src:
        dstip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection and not filter_*
fields:
    - user
    - attack
    - url
    - srcip
    - srccountry
    - dstip
falsepositives:
    - Unknown.
level: medium