title: SEP Network Detection - MSIE Signature
id: 95caf603-6e87-4cc2-8dea-ee281e80e999
status: experimental
description: Detects Symantec Endpoint Protection host network detection event indicating an 'MSIE' signature.
references:
    - https://icd-schema.symantec.com/type/8040
    - https://www.broadcom.com/support/security-center/attacksignatures?
author: Jay Tymchuk
date: 2024/01/30
tags:
    - attack.initial_access
logsource:
    category: antivirus
    product: symantec_endpoint_protection
detection:
    selection:
        event_id|startswith: '8040'  # Event ID for Symantec Endpoint Protection Host Network Detection events 
        threat|startswith: 'MSIE'    # MSIE Signatures are Microsoft Internet Explorer type signatures
        device_ip|cidr:               # We only want ot moinitor signatures from private IPs (internal assets) 
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection
falsepositives:
    - Filter any external vulnerability scanners.
    - Filter any Attack signatures which are not relevant in the environment.
level: medium
