title: SEP File Detection - Security Risk
id: b9e5c6c3-8600-4756-9df5-8114f7a213c7
status: experimental
description: Detects Symantec Endpoint Protection host file detection event indicating a 'Security Risk' signature.
references:
    - https://icd-schema.symantec.com/type/8031
    - https://www.broadcom.com/support/security-center/attacksignatures?
author: Jay Tymchuk
date: 2024/01/30
tags:
    - attack.initial_access
logsource:
    category: antivirus
    product: symantec_endpoint_protection
detection:
    selection:
        event_id|startswith: '8031'
        type: 'Security Risk'
        device_ip|cidr:
            - '127.0.0.0/8'
            - '10.0.0.0/8'
            - '172.16.0.0/12'
            - '192.168.0.0/16'
    condition: selection
falsepositives:
    - Filter any external vulnerability scanners.
    - Filter any Attack signatures which are not relevant in the environment.
level: medium