title: FortiGate UTM ICAP Infection Detected
id: b8cf15ce-22c3-4bc6-9139-35f30c6c5088
status: experimental
description: Detects FortiGate UTM Internet Content Adapation Protocol (ICAP) traffic blocked indicating a potential infection.
references:
    - https://docs.fortinet.com/document/fortigate/7.4.1/fortios-log-message-reference/60001/60001-log-id-icap-infection-block
    - https://docs.fortinet.com/document/fortigate/7.4.1/administration-guide/952611/icap
    - https://docs.fortinet.com/document/fortigate/7.4.2/administration-guide/382787/icap-response-filtering
tags:
    - attack.command-and-control
author: '@JayInfoSec'
date: 2023/11/20
logsource:
    category: appliance
    product: fortigate
    service: utm
detection:
    selection:
        type: 'utm'
        subtype: 'icap'
        logid|endswith:
            - '60001'   # Traffic blocked as ICAP server found infection.
    condition: selection
fields:
    - msg
    - action
    - url
    - dstip
    - infection
    - virusid
falsepositives:
    - Unknown
level: low